back-end-cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats" ORDER BY "cats"."likes" DESC
SELECT "cats".* FROM "cats"
---
    def index

        if (params[:order] == "true")
            cats = Cat.order(likes: :desc)
        else
            cats = Cat.all

INSERT INTO "cats" ("name", "image", "likes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Snow"], ["image", "http://catsitterdiary.com/learnco/react/cats/5.jpg"], ["likes", 0], ["created_at", "2021-06-19 15:40:53.011868"], ["updated_at", "2021-06-19 15:40:53.011868"]]
---
     def create

        @cat = Cat.new
        @cat.name= params[:name]
        @cat.image= params[:image]
        @cat.likes= 0
        @cat.save

SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "likes" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["likes", "1"], ["updated_at", "2021-06-15 04:41:20.941160"], ["id", 1]]
---
    def update

        @cat = Cat.find(params[:id])
        @cat.likes = @cat.likes.to_i + 1
        @cat.save