back-end-cats/app/controllers/comments_controller.rb

SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
INSERT INTO "comments" ("cat_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["cat_id", 10], ["comment", "purr"], ["created_at", "2021-06-14 20:02:25.662961"], ["updated_at", "2021-06-14 20:02:25.662961"]]
---
    def create

        @comment = Comment.new
        @comment.comment= params[:text]


        @cat = Cat.find_by_id(params[:catId])

        @comment.cat = @cat
        @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 64], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 66]]
---
    def destroy
        @comment = Comment.find_by_id(params[:id])
        @cat= @comment.cat

        @comment.destroy